[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateHeader.js:1:31
-const generateHeader = arr => {
-  let header = '| |';
-
-  for(let i = 0; i < arr.length; i++) {
-    header += ` ${arr[i]}|`;
-  };
-
-  return header;
-};
+const generateHeader = arr => {};
 
 exports.generateHeader = generateHeader;

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/generateHeader.js:4:18
 const generateHeader = arr => {
   let header = '| |';
 
-  for(let i = 0; i < arr.length; i++) {
+  for(let i = 0; false; i++) {
     header += ` ${arr[i]}|`;
   };

[Killed] StringLiteral
makers/findmypast-tech-test/lib/generateHeader.js:5:15
   let header = '| |';
 
   for(let i = 0; i < arr.length; i++) {
-    header += ` ${arr[i]}|`;
+    header += ``;
   };
 
