[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:9:36
   return flatten.slice(-1)[0].toString().length;
 };
 
-const generateTableRows = array => {
-  let rows = '';
-  const multiples = generateMultiples(array);
-  const padding = calculatePadding(multiples);
-
-  multiples.forEach(arr => {
-    rows += '|';
-
-    arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
-
-        rows += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
-      });
-    }
-  );
-  
-  return rows;
-};
+const generateTableRows = array => {};
 
 exports.generateTableRows = generateTableRows;

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:14:28
   const multiples = generateMultiples(array);
   const padding = calculatePadding(multiples);
 
-  multiples.forEach(arr => {
-    rows += '|';
-
-    arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
-
-        rows += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
-      });
-    }
+  multiples.forEach(arr => {}
   );
   

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:17:37
   multiples.forEach(arr => {
     rows += '|';
 
-    arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
-
-        rows += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
-      });
+    arr.forEach((element, index) => {});
     }
   );

[Killed] EqualityOperator
makers/findmypast-tech-test/lib/generateTableRows.js:20:17
     arr.forEach((element, index) => {
         const paddedElement = element.toString().padStart(padding, " ");
 
-        rows += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
+        rows += index === arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
       });
     }

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/generateTableRows.js:20:17
     arr.forEach((element, index) => {
         const paddedElement = element.toString().padStart(padding, " ");
 
-        rows += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
+        rows += false ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
       });
     }
