[Survived] ObjectLiteral
makers/findmypast-tech-test/lib/app.js:2:54
 const { generateMultiplicationTable } = require('./generateMultiplicationTable');
-const readline = require('readline').createInterface({
-  input: process.stdin,
-  output: process.stdout
-})
+const readline = require('readline').createInterface({})
 
 readline.question('Please enter an integer > 0!\n', input => {

[Survived] BlockStatement
makers/findmypast-tech-test/lib/app.js:7:62
   output: process.stdout
 })
 
-readline.question('Please enter an integer > 0!\n', input => {
-  try {
-    console.log(generateMultiplicationTable(Number(input)));
-  } catch {
-    console.log('Input needs to be an integer > 0!\n');
-  }
-  readline.close();
-});
+readline.question('Please enter an integer > 0!\n', input => {});
 

[Survived] BlockStatement
makers/findmypast-tech-test/lib/app.js:8:7
 })
 
 readline.question('Please enter an integer > 0!\n', input => {
-  try {
-    console.log(generateMultiplicationTable(Number(input)));
-  } catch {
+  try {} catch {
     console.log('Input needs to be an integer > 0!\n');
   }

[Survived] BlockStatement
makers/findmypast-tech-test/lib/app.js:10:11
 readline.question('Please enter an integer > 0!\n', input => {
   try {
     console.log(generateMultiplicationTable(Number(input)));
-  } catch {
-    console.log('Input needs to be an integer > 0!\n');
-  }
+  } catch {}
   readline.close();
 });

[Survived] StringLiteral
makers/findmypast-tech-test/lib/app.js:11:17
   try {
     console.log(generateMultiplicationTable(Number(input)));
   } catch {
-    console.log('Input needs to be an integer > 0!\n');
+    console.log("");
   }
   readline.close();
