[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateHeader.js:1:42
-const generateHeader = (arr, padding) => {
-  let header = `| ${" ".padStart(padding, " ")}|`;
-
-  for(let i = 0; i < arr.length; i++) {
-    const paddedElement = arr[i].toString().padStart(padding, " ");
-
-    header += ` ${paddedElement}|`;
-  };
-
-  return header + '\n';
-};
+const generateHeader = (arr, padding) => {};
 
 exports.generateHeader = generateHeader;

[Killed] StringLiteral
makers/findmypast-tech-test/lib/generateHeader.js:2:43
 const generateHeader = (arr, padding) => {
-  let header = `| ${" ".padStart(padding, " ")}|`;
+  let header = `| ${" ".padStart(padding, "")}|`;
 
   for(let i = 0; i < arr.length; i++) {

[Killed] EqualityOperator
makers/findmypast-tech-test/lib/generateHeader.js:4:18
 const generateHeader = (arr, padding) => {
   let header = `| ${" ".padStart(padding, " ")}|`;
 
-  for(let i = 0; i < arr.length; i++) {
+  for(let i = 0; i >= arr.length; i++) {
     const paddedElement = arr[i].toString().padStart(padding, " ");
 

[Killed] EqualityOperator
makers/findmypast-tech-test/lib/generateHeader.js:4:18
 const generateHeader = (arr, padding) => {
   let header = `| ${" ".padStart(padding, " ")}|`;
 
-  for(let i = 0; i < arr.length; i++) {
+  for(let i = 0; i <= arr.length; i++) {
     const paddedElement = arr[i].toString().padStart(padding, " ");
 

[Killed] StringLiteral
makers/findmypast-tech-test/lib/generateHeader.js:5:63
   let header = `| ${" ".padStart(padding, " ")}|`;
 
   for(let i = 0; i < arr.length; i++) {
-    const paddedElement = arr[i].toString().padStart(padding, " ");
+    const paddedElement = arr[i].toString().padStart(padding, "");
 
     header += ` ${paddedElement}|`;

[Killed] ArithmeticOperator
makers/findmypast-tech-test/lib/generateHeader.js:10:10
     header += ` ${paddedElement}|`;
   };
 
-  return header + '\n';
+  return header - '\n';
 };
 

[Killed] StringLiteral
makers/findmypast-tech-test/lib/generateHeader.js:10:19
     header += ` ${paddedElement}|`;
   };
 
-  return header + '\n';
+  return header + "";
 };
 
