[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateMultiples.js:1:34
-const generateMultiples = arr => {
-  const multiples = [];
-  
-  for(let i = 0; i < arr.length; i++) {
-    let row = [arr[i]];
-
-    for(let j = 0; j < arr.length; j++) {
-      row.push(arr[i] * arr[j]);
-    };
-
-    multiples.push(row);
-  };
-
-  return multiples;
-};
+const generateMultiples = arr => {};
 
 exports.generateMultiples = generateMultiples;

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateMultiples.js:4:39
 const generateMultiples = arr => {
   const multiples = [];
   
-  for(let i = 0; i < arr.length; i++) {
-    let row = [arr[i]];
-
-    for(let j = 0; j < arr.length; j++) {
-      row.push(arr[i] * arr[j]);
-    };
-
-    multiples.push(row);
-  };
+  for(let i = 0; i < arr.length; i++) {};
 
   return multiples;

[Killed] ArrayDeclaration
makers/findmypast-tech-test/lib/generateMultiples.js:5:15
   const multiples = [];
   
   for(let i = 0; i < arr.length; i++) {
-    let row = [arr[i]];
+    let row = [];
 
     for(let j = 0; j < arr.length; j++) {

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateMultiples.js:7:41
   for(let i = 0; i < arr.length; i++) {
     let row = [arr[i]];
 
-    for(let j = 0; j < arr.length; j++) {
-      row.push(arr[i] * arr[j]);
-    };
+    for(let j = 0; j < arr.length; j++) {};
 
     multiples.push(row);

[Killed] EqualityOperator
makers/findmypast-tech-test/lib/generateMultiples.js:7:20
   for(let i = 0; i < arr.length; i++) {
     let row = [arr[i]];
 
-    for(let j = 0; j < arr.length; j++) {
+    for(let j = 0; j <= arr.length; j++) {
       row.push(arr[i] * arr[j]);
     };

[Killed] ArithmeticOperator
makers/findmypast-tech-test/lib/generateMultiples.js:8:16
     let row = [arr[i]];
 
     for(let j = 0; j < arr.length; j++) {
-      row.push(arr[i] * arr[j]);
+      row.push(arr[i] / arr[j]);
     };
 
