[Killed] BlockStatement
makers/findmypast-tech-test/lib/generatePrimesArray.js:3:34
 const isPrime = require('./isPrime');
 
-const generatePrimesArray = n => {
-  const primes = [];
-
-  for(let i = 2; primes.length < n; i++) {
-    if(isPrime(i)) primes.push(i);
-  };
-
-  return primes;
-};
+const generatePrimesArray = n => {};
 
 exports.generatePrimesArray = generatePrimesArray;

[Killed] UpdateOperator
makers/findmypast-tech-test/lib/generatePrimesArray.js:6:37
 const generatePrimesArray = n => {
   const primes = [];
 
-  for(let i = 2; primes.length < n; i++) {
+  for(let i = 2; primes.length < n; i--) {
     if(isPrime(i)) primes.push(i);
   };

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/generatePrimesArray.js:6:18
 const generatePrimesArray = n => {
   const primes = [];
 
-  for(let i = 2; primes.length < n; i++) {
+  for(let i = 2; false; i++) {
     if(isPrime(i)) primes.push(i);
   };

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/generatePrimesArray.js:7:8
   const primes = [];
 
   for(let i = 2; primes.length < n; i++) {
-    if(isPrime(i)) primes.push(i);
+    if(true) primes.push(i);
   };
 

[Timeout] ConditionalExpression
makers/findmypast-tech-test/lib/generatePrimesArray.js:7:8
   const primes = [];
 
   for(let i = 2; primes.length < n; i++) {
-    if(isPrime(i)) primes.push(i);
+    if(false) primes.push(i);
   };
 
