[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:5:35
 
 let padding;
 
-const calculatePadding = array => {
-  const flatten = array.flat();
-
-  return flatten.slice(-1)[0].toString().length;
-};
+const calculatePadding = array => {};
 
 const formatRowsString = (multiples, padding) => {

[Killed] UnaryOperator
makers/findmypast-tech-test/lib/generateTableRows.js:8:24
 const calculatePadding = array => {
   const flatten = array.flat();
 
-  return flatten.slice(-1)[0].toString().length;
+  return flatten.slice(+1)[0].toString().length;
 };
 

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:11:50
   return flatten.slice(-1)[0].toString().length;
 };
 
-const formatRowsString = (multiples, padding) => {
-  let rowsString = '';
-
-  multiples.forEach(arr => {
-    rowsString += '|';
-    arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
-
-        rowsString += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
-      });
-    }
-  );
-
-  return rowsString;
-};
+const formatRowsString = (multiples, padding) => {};
 
 const generateTableRows = array => {

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:14:28
 const formatRowsString = (multiples, padding) => {
   let rowsString = '';
 
-  multiples.forEach(arr => {
-    rowsString += '|';
-    arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
-
-        rowsString += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
-      });
-    }
+  multiples.forEach(arr => {}
   );
 

[Killed] StringLiteral
makers/findmypast-tech-test/lib/generateTableRows.js:15:19
   let rowsString = '';
 
   multiples.forEach(arr => {
-    rowsString += '|';
+    rowsString += "";
     arr.forEach((element, index) => {
         const paddedElement = element.toString().padStart(padding, " ");

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:16:37
 
   multiples.forEach(arr => {
     rowsString += '|';
-    arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
-
-        rowsString += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
-      });
+    arr.forEach((element, index) => {});
     }
   );

[Killed] StringLiteral
makers/findmypast-tech-test/lib/generateTableRows.js:17:68
   multiples.forEach(arr => {
     rowsString += '|';
     arr.forEach((element, index) => {
-        const paddedElement = element.toString().padStart(padding, " ");
+        const paddedElement = element.toString().padStart(padding, "");
 
         rowsString += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;

[Killed] EqualityOperator
makers/findmypast-tech-test/lib/generateTableRows.js:19:23
     arr.forEach((element, index) => {
         const paddedElement = element.toString().padStart(padding, " ");
 
-        rowsString += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
+        rowsString += index === arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
       });
     }

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/generateTableRows.js:19:23
     arr.forEach((element, index) => {
         const paddedElement = element.toString().padStart(padding, " ");
 
-        rowsString += index !== arr.length - 1 ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
+        rowsString += true ? ` ${paddedElement}|` : ` ${paddedElement}|\n`;
       });
     }

[Killed] BlockStatement
makers/findmypast-tech-test/lib/generateTableRows.js:27:36
   return rowsString;
 };
 
-const generateTableRows = array => {
-  const multiples = generateMultiples(array);
-  padding = calculatePadding(multiples);
-  rows = formatRowsString(multiples, padding);
-  
-  return { rows, padding };
-};
+const generateTableRows = array => {};
 
 exports.generateTableRows = generateTableRows;
