[Killed] BlockStatement
makers/findmypast-tech-test/lib/isPrime.js:1:22
-const isPrime = n => {
-  for(let i = 2; i <= Math.sqrt(n); i++) {
-    if(n % i === 0) return false;
-  };
-  return true;
-};
+const isPrime = n => {};
 
 module.exports = isPrime;

[Killed] BlockStatement
makers/findmypast-tech-test/lib/isPrime.js:2:42
 const isPrime = n => {
-  for(let i = 2; i <= Math.sqrt(n); i++) {
-    if(n % i === 0) return false;
-  };
+  for(let i = 2; i <= Math.sqrt(n); i++) {};
   return true;
 };

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/isPrime.js:2:18
 const isPrime = n => {
-  for(let i = 2; i <= Math.sqrt(n); i++) {
+  for(let i = 2; false; i++) {
     if(n % i === 0) return false;
   };

[Killed] ArithmeticOperator
makers/findmypast-tech-test/lib/isPrime.js:3:8
 const isPrime = n => {
   for(let i = 2; i <= Math.sqrt(n); i++) {
-    if(n % i === 0) return false;
+    if(n * i === 0) return false;
   };
   return true;

[Killed] ConditionalExpression
makers/findmypast-tech-test/lib/isPrime.js:3:8
 const isPrime = n => {
   for(let i = 2; i <= Math.sqrt(n); i++) {
-    if(n % i === 0) return false;
+    if(false) return false;
   };
   return true;

[Killed] BooleanLiteral
makers/findmypast-tech-test/lib/isPrime.js:5:10
   for(let i = 2; i <= Math.sqrt(n); i++) {
     if(n % i === 0) return false;
   };
-  return true;
+  return false;
 };
 
